Public Attributes | List of all members
API_OverriddenFillType Struct Reference
Graphic Overrides
Describes the fill types to be overridden. More...
#include <APIdefs_Environment.h>
 Public Attributes
bool  | overrideCutFill
Specifies if cut fills should be overridden.
bool  | overrideCoverFill
Specifies if cover fills should be overridden.
bool  | overrideDraftingFill
Specifies if drafting fills should be overridden.
Detailed Description
Describes the fill types to be overridden.
Member Data Documentation
◆ overrideCoverFill
 API_OverriddenFillType::overrideCoverFill
Specifies if cover fills should be overridden.
◆ overrideCutFill
 API_OverriddenFillType::overrideCutFill
Specifies if cut fills should be overridden.
◆ overrideDraftingFill
 API_OverriddenFillType::overrideDraftingFill
Specifies if drafting fills should be overridden.